#include <unistd.h>

int main(int argc, char **argv)
{
    int i = 0; // ինդեքս argv[1]-ի վրա (փնտրվող տող)
    int j = 0; // ինդեքս argv[2]-ի վրա (որ տողի մեջ փնտրում ենք)

    if (argc == 3) // Պետք է լինեն ճիշտ 2 պարամետր
    {
        while (argv[1][i] && argv[2][j]) // Մինչև վերջ չհասնենք
        {
            if (argv[1][i] == argv[2][j]) // Եթե համապատասխան տառ գտանք
                i++; // Հաջորդ տառին անցնել
            j++; // Անկախ նրանից՝ համապատասխանում է, թե ոչ՝ միշտ j++ (շարժվենք առաջ)
        }
        if (argv[1][i] == '\0') // Եթե ամբողջ argv[1]-ը անցանք՝ գտանք
            write(1, "1\n", 2);
        else // Եթե ինչ–որ տառ մնացել է՝ չի գտնվել
            write(1, "0\n", 2);
    }
    else // Սխալ պարամետրերի քանակ
        write(1, "\n", 1);
    return (0);
}
